In [1]:
import numpy as np
import pandas as pd

In [11]:
dict1={
       "name"  : ['harry','mini','sofia','us'],
       "marks" : [30,53,87,76],
       "add" : ['India','argentina','finland','france']
        }

In [13]:

df=pd.DataFrame(dict1)

In [14]:
df

    name  marks        add
0  harry     30      India
1   mini     53  argentina
2  sofia     87    finland
3     us     76     france